Autodesk.Revit.DB.Plumbing.FlexPipe.IsLevelId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks if given element id is valid level element.
document:
The document.
levelId:
ElementId of the level to check.
Returns:
True if the given level id is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Plumbing.FlexPipe.IsPipingSystemTypeId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks if given type is valid piping system type.
document:
The document.
systemTypeId:
ElementId of the piping system type to check.
Returns:
True if the given systemTypeId is the piping system type, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Plumbing.FlexPipe.IsFlexPipeTypeId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks if given type is valid flexible pipe type.
Remarks:
A type is valid for flexible pipe if it can be used to the flexible pipe element.
document:
The document.
pipeTypeId:
ElementId of the flexible pipe type to check.
Returns:
True if flexible pipe type can used for this pipe, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Plumbing.FlexPipe.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates a new flexible pipe into the document, using a point array and flex pipe type.
document:
The document.
systemTypeId:
The id of the piping system type.
pipeTypeId:
The id of the flexible pipe.
levelId:
The level id for the flexible pipe.
startTangent:
The tangent vector at the start of the curve. The invalid or zero vector is ignored.
endTangent:
The tangent vector at the end of the curve. The invalid or zero vector is ignored.
points:
The point array indicating the path of the flexible pipe, including the end point.
Returns:
If creation was successful then a new flexible pipe is returned, otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The systemTypeId is not valid piping system type.
-or-
The type pipeTypeId is not valid flexible pipe type.
-or-
The ElementId levelId is not a Level.
-or-
The valid number of points is less than two. In order to create a flex curve, at least two points are required. Note the duplicate points don't take into account.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2014

Autodesk.Revit.DB.Plumbing.FlexPipe.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates a new flexible pipe into the document, using a point array and flex pipe type.
document:
The document.
systemTypeId:
The id of the piping system type.
pipeTypeId:
The id of the flexible pipe.
levelId:
The level id for the flexible pipe.
points:
The point array indicating the path of the flexible pipe, including the end point.
Returns:
If creation was successful then a new flexible pipe is returned, otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The systemTypeId is not valid piping system type.
-or-
The type pipeTypeId is not valid flexible pipe type.
-or-
The ElementId levelId is not a Level.
-or-
The valid number of points is less than two. In order to create a flex curve, at least two points are required. Note the duplicate points don't take into account.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2014

Autodesk.Revit.DB.Plumbing.FlexPipe.EndTangent
Gets or sets the tangent vector at the end of the curve. The invalid or zero vector is ignored when setting the tangent.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Plumbing.FlexPipe.StartTangent
Gets or sets the tangent vector at the start of the curve. The invalid or zero vector is ignored when setting the tangent.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Plumbing.FlexPipe.Points
The points of the flex pipe.
Remarks: This property is used to retrieve the points of flex pipe, including the end points.
If the end points are changed, the connection will be maintained by Revit automatically.
The set operation will fail if the modification makes the connection invalid.

Autodesk.Revit.DB.Plumbing.FlexPipe.FlexPipeType
The flex pipe type of this flex pipe.

Autodesk.Revit.DB.Plumbing.FlexPipe.FlowState
The flow state of the pipe.

Autodesk.Revit.DB.Plumbing.FlexPipe
A flex pipe in the Autodesk Revit MEP product.
Remarks:
The flex pipe is only available in the Autodesk Revit MEP product.